# TAPS
tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "domt4/autoupdate"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "k0sproject/tap"
tap "knative-sandbox/kn-plugins"
tap "vmware-tanzu/pinniped"

# BREWS
# brew "binwalk"
# brew "cfssl"
# brew "clusterctl"
# brew "dfu-util"
# brew "ffmpeg"
# brew "flux"
# brew "gstreamer"
# brew "libftdi"
# brew "libsigrok"
# brew "libusb"
# brew "lsusb"
# brew "minipro"
# brew "nmap"
# brew "qemu"
# brew "squashfs"
# brew "tektoncd-cli"
# brew "terraform"
# brew "transmission-cli"
# brew "u-boot-tools"
# brew "wimlib"
brew "cosign"
brew "func"
brew "gh"
brew "git-lfs"
brew "git-review"
brew "git"
brew "gnupg"
brew "gnutls"
brew "helm"
brew "jq"
brew "k0sctl"
brew "kind"
brew "kn"
brew "krew"
brew "kubernetes-cli"
brew "kustomize"
brew "mas"
brew "open-ocd"
brew "openjdk"
brew "openstackclient"
brew "p7zip"
brew "pinentry-mac"
brew "pinentry"
brew "pinniped-cli"
brew "s3cmd"
brew "shfmt"
brew "sigrok-cli"
brew "socket_vmnet"
brew "sops"
brew "swtpm"
brew "terminal-notifier"
brew "trivy"
brew "virt-manager"
brew "winetricks"
brew "yq"
brew "zsh-completions"

# CASKS
# cask "anydesk"
# cask "balenaetcher"
# cask "blender"
# cask "dcp-o-matic-player"
# cask "ff-works"
# cask "fl-studio"
# cask "fontlab"
# cask "gstreamer-runtime"
# cask "iina"
# cask "ilok-license-manager"
# cask "ios-app-signer"
# cask "kicad"
# cask "kodi"
# cask "mongodb-compass"
# cask "mysqlworkbench"
# cask "pgadmin4"
# cask "powerpanel"
# cask "transmission"
# cask "unetbootin"
cask "appcleaner"
cask "brewservicesmenubar"
cask "caffeine"
cask "core-tunnel"
cask "cyberduck"
cask "docker"
cask "firefox"
cask "gpg-suite"
cask "ipvanish-vpn"
cask "jetbrains-gateway"
cask "keystore-explorer"
cask "lens"
cask "lingon-x"
cask "microsoft-edge"
cask "microsoft-teams", args: { appdir: "/Applications" }
cask "postman"
cask "tor-browser"
cask "tunnelblick"
cask "visual-studio-code"
cask "webex"
cask "wine-stable"
cask "wireshark"
cask "xquartz"

# App Store
# mas "Classroom", id: 1358883623
# mas "Compressor", id: 424390742
# mas "Core Tunnel", id: 1354318707
# mas "Cyberduck", id: 409222199
# mas "DaisyDisk", id: 411643860
# mas "Display Menu", id: 549083868
# mas "Evernote", id: 406056744
# mas "Final Cut Pro", id: 424389933
# mas "Frame.io", id: 992958444
# mas "GarageBand", id: 682658836
# mas "iBooks Author", id: 490152466
# mas "iMovie", id: 408981434
# mas "iStudiez Pro", id: 402989379
# mas "Logic Pro", id: 634148309
# mas "MindNode", id: 1289197285
# mas "Night Sky", id: 475772902
# mas "Pixelmator Pro", id: 1289583905
# mas "SendToX", id: 496926258
# mas "Serial", id: 877615577
# mas "Shazam", id: 897118787
# mas "Shot Notes X", id: 853468135
# mas "Sync-N-Link X", id: 517599985
# mas "Textual IRC Client", id: 1262957439
# mas "Transporter", id: 1450874784
# mas "VisualDesigner", id: 1193683552
# mas "X2Pro Audio Convert", id: 501688639
# mas "Xcode", id: 497799835
# mas "XtoCC", id: 487899517
mas "Apple Configurator", id: 1037126344
mas "Developer", id: 640199958
mas "HextEdit", id: 1557247094
mas "iA Writer", id: 775737590
mas "iStat Menus", id: 1319778037
mas "Keynote", id: 409183694
mas "MermaidEditor", id: 1581312955
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "SSH Config Editor", id: 1109319285
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650

# VSCODE
vscode "aaron-bond.better-comments"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "christian-kohler.path-intellisense"
vscode "coder.coder-remote"
vscode "codezombiech.gitignore"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hbenl.vscode-test-explorer"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "mechatroner.rainbow-csv"
vscode "minherz.copyright-inserter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-serial-monitor"
vscode "patbenatar.advanced-new-file"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "tariky.easy-snippet-maker"
vscode "techer.open-in-browser"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
